app/Frontend/Middleware/MenuInit.php

    public function handle($request, Closure $next)
    {
        \Menu::make('top_menu', function ($menu) {
            $category = DB::table('shop_categories')->where('parent_id', 0)->get();
            foreach ($category as $key => $value) {
                $menu->add($value->title, ['url' => $value->slug, 'class' => 'nav-item'])->link->attr(['class' => 'nav-link']);
            }
            $menu->divide();
        });

        /* ============ категории магазина =============== */
        $shop_cat = array();
        $shop_cat_sql = DB::table('shop_categories')->get();
---
select * from `shop_categories` where `parent_id` = 0
select * from `shop_categories`