app/Frontend/Controllers/Shop/OrderController.php

    public function store(Request $request)
    {
        $name = $request->name;
        $email = $request->email;
        $phone = $request->phone;
        $comment = $request->comment;
        $cart = $request->session()->get('cart');
        $total = $request->session()->get('total');

        $cart_html = '';
        if (\count($cart)) {
            $cart_ids = implode(', ', array_keys($cart));
            $cart_ids = explode(',', $cart_ids);
            $cart_array = DB::table('shop_products')->whereIn('id', $cart_ids)->get();
---
select * from `shop_products` where `id` in ('2')

            'updated_at' => \Carbon\Carbon::now(),
        ];

        DB::table('shop_orders')->insert($data);
---
insert into `shop_orders` (`name`, `email`, `phone`, `comment`, `order`, `total`, `created_at`, `updated_at`) values ('eerer', 'mary13zolkina@gmail.com', '', '', '2 - Product 2 - 10<br/>', 10, '2020-07-18 23:00:15', '2020-07-18 23:00:15')